# -*- coding: utf-8 -*-
"""Lite15.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/10Fupy9FIEoUgm2XPYMEu8ySdy02zoYLs

Задание Lite
Сравните скорость распознавания речи моделей tiny, base, small, medium, large библиотеки whisper (локальной).
Постройте столбчатую диаграмму сравнения скоростей. Для сравнения можно использовать любую аудиозапись с занятия.
"""

# установка библиотек
!pip install -U openai-whisper

import os
os.environ["PATH"] = "c:/BIN/ffmpeg/bin"
os.environ["PATH"].split(os.pathsep)

import whisper
from pprint import pprint

# пример базового применения
model = whisper.load_model("base")
result = model.transcribe("C:/Data/Study/NU/Web/15/data/Manager.mp3")
print(result['text'])

file_mp3 = "C:/Data/Study/NU/Web/15/data/Manager.mp3"
# пример базового применения
model = whisper.load_model("base")
result = model.transcribe(file_mp3)
print(result['text'])

file_mp3 = "C:/Data/Study/NU/Web/15/data/Manager.mp3"

# использование модели "medium"
model = whisper.load_model("medium")
result2 = model.transcribe(file_mp3)
print(result2['text'])

# использование модели "medium"
# model_me = whisper.load_model("medium")
# result2 = model.transcribe(file_mp3)
# print(result2['text'])

# использование модели "large"
model_la = whisper.load_model("large")
result3 = model_la.transcribe(file_mp3)
print(result3['text'])

# использование модели "large"
model_la = whisper.load_model("large")
result3 = model_la.transcribe(file_mp3)
print(result3['text'])

# использование модели "large"
model_ti = whisper.load_model("tiny")
result4 = model_ti.transcribe(file_mp3)
print(result4['text'])

# использование модели "large"
model_ti = whisper.load_model("small")
result4 = model_ti.transcribe(file_mp3)
print(result4['text'])

# использование модели "large"
model_ti = whisper.load_model("small")
result4 = model_ti.transcribe(file_mp3)
print(result4['text'])

"""base 37.8  13.7 13.5
medium -  40  41.6
tiny 32.3 10.3
small 69.2  17.7
large 6*60+41

small 461 Мб
tiny 76 Mb
medium 1.6 Gb
base 700 Mb
large 2.88G



"""

di = {"tiny":10.3, "base":13.7, "small":17.7, "medium":40, "large":78.2}

# di = {"tiny":1, "base":7, "small":17.7, "medium":40, "large":5}

"""python Построить столбчатую диаграмму сравнения скоростей
di = {"tiny":1, "base":7, "small":3, "medium":4, "large":5}

"""

import matplotlib.pyplot as plt

data = di

labels = list(data.keys())
values = list(data.values())

plt.bar(labels, values, color='skyblue')
plt.xlabel('Размеры')
plt.ylabel('Скорости')
plt.title('Сравнение скоростей')
plt.show()

